<a href="https://colab.research.google.com/github/igorTyugaev/labs_python_sber/blob/main/Homework1ML(IgorTyugaev)_ipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

**1\.** Как создать pd.Series из листа, numpy array и словаря(dict)? (★☆☆)

In [ ]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

#your code
s1 = pd.Series(mylist)
s2 = pd.Series(myarr)
s3 = pd.Series(mydict)

print(s1.head())
print(s2.head())
print(s3.head())

0    a
1    b
2    c
3    e
4    d
dtype: object
0    0
1    1
2    2
3    3
4    4
dtype: int64
a    0
b    1
c    2
e    3
d    4
dtype: int64

**2\.** Как сделать превратить индексы из датафрейма в колонку? (★☆☆)

In [ ]:
df=pd.DataFrame(['a', 'b', 'c'])

#your code
print("Original: \n", df, "\n")

df_2 = df.copy()
print("Transposed: \n", df_2.T, "\n") # Если имелось ввиду транспонированная матрица

df_3 = df.copy()
df_3['index'] = df_3.index # Можем записать индексы как новый столбец
print("Index to col: \n", df_3, "\n")

df_4 = df.copy()
df_4 = df_4.reset_index() # Можем выполнить переиндесацию, при этом сох-я старые индексы (в колонку)
print("Reset index: \n", df_4, "\n")

Original:
    0
0  a
1  b
2  c

Transposed:
    0  1  2
0  a  b  c

Index to col:
    0  index
0  a      0
1  b      1
2  c      2

Reset index:
    index  0
0      0  a
1      1  b
2      2  c

**3\.** Как из нескольких pd.Series сделать один датафрейм? (★★☆)

(hint: pd.concat или словарь с колонками)

In [ ]:
df1=pd.Series(['a', 'b', 'c'])
df2=pd.Series(['aa', 'b1', 'c2'])
df3=pd.Series(['44', '55', '66'])

#your code
df_4 = pd.concat([df1,df2,df3],axis=1) # Выполняем объеденение данных по столбцам
# получили датафрейм
# Но все-таки серии обычно считаються за строки,
# поэтому выполним транспонирование
df_4.T

    0   1   2
0   a   b   c
1  aa  b1  c2
2  44  55  66

**4\.** Как получить строки из series A, которые не содержатся в series B? (★★☆)

In [ ]:
df1=pd.Series(['a', 'b', 'c'])
df2=pd.Series(['a', 'b1', 'c2'])

#your code
# Понял это как LEFT OUTER JOIN для этих серий
dfA = pd.DataFrame(df1)
dfB = pd.DataFrame(df2)

df_out = pd.merge(dfA, dfB, how="outer", indicator=True)
df_out.query('_merge=="left_only"')[0]

1    b
2    c
Name: 0, dtype: object

**5\.** Как получить из series/dataframe минимум, 25й персентиль, медиану, 75тый персентиль, максимум? (★☆☆)

(hint: использовать одну команду)

In [ ]:
df1=pd.Series(np.arange(10, 99))

#your code
df1.describe()

count    89.000000
mean     54.000000
std      25.836021
min      10.000000
25%      32.000000
50%      54.000000
75%      76.000000
max      98.000000
dtype: float64

**6\.** Как получить частоту\долю для всех уникальных объектов в series? (★☆☆)

In [ ]:
df1=pd.Series(['a', 'b', 'c', 'g', 'v', 'a', 'a', 'a', 'u', 'a', 'b', 'c', 'c'])

#your code
df1.value_counts(normalize = True)

a    0.384615
c    0.230769
b    0.153846
g    0.076923
u    0.076923
v    0.076923
dtype: float64

**7\.** Как оставить только топ-2 самых часто встречающихся значений, а все остальные значения заменить на 'other'?  (★★☆)

In [ ]:
df1=pd.Series(['a', 'b', 'c', 'g', 'v', 'a', 'a', 'a', 'u', 'a', 'b', 'c', 'c'])

#your code
cor = df1.value_counts()[:2].index
print("Топ-2 самых часто встречающихся значений:", cor)
df1.apply(lambda x: x if (x==cor[0] or x==cor[1]) else 'other')

Топ-2 самых часто встречающихся значений: Index(['a', 'c'], dtype='object')

0         a
1     other
2         c
3     other
4     other
5         a
6         a
7         a
8     other
9         a
10    other
11        c
12        c
dtype: object

**8\.** Как разбить колонку с числовыми значениями на 10 групп одинакового размера?  (★★☆)

(hint: pd.qcut)

In [ ]:
s = pd.Series(np.random.random(20))

#your code
pd.qcut(s, 10)

0      (0.266, 0.306]
1      (0.751, 0.818]
2     (0.0897, 0.132]
3      (0.266, 0.306]
4      (0.306, 0.454]
5      (0.165, 0.266]
6      (0.454, 0.492]
7      (0.132, 0.165]
8      (0.818, 0.992]
9      (0.618, 0.751]
10     (0.454, 0.492]
11     (0.492, 0.618]
12     (0.492, 0.618]
13     (0.751, 0.818]
14     (0.165, 0.266]
15     (0.818, 0.992]
16     (0.132, 0.165]
17    (0.0897, 0.132]
18     (0.306, 0.454]
19     (0.618, 0.751]
dtype: category
Categories (10, interval[float64]): [(0.0897, 0.132] < (0.132, 0.165] < (0.165, 0.266] <
                                     (0.266, 0.306] ... (0.492, 0.618] < (0.618, 0.751] <
                                     (0.751, 0.818] < (0.818, 0.992]]

**9\.** Как найти позиции чисел, которые делятся на 3 без остатка из series?  (★★☆)

(можно с помощью numpy и с помощью pandas)

In [ ]:
s = pd.Series(np.random.randint(100, size=20))

#your code
s.loc[s % 3 == 0].index

Int64Index([0, 4, 9, 12, 13, 14], dtype='int64')

**10\.** Как извлечь из series строки по индексам?  (★☆☆)

In [ ]:
s = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

#your code
s.iloc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

**11\.** Как сделать stack двух series вертикально и горизонтально? (★☆☆)

(hint: pd.append, pd.concat)

In [ ]:
s1 = pd.Series(range(5))
s2 = pd.Series(list('abcde'))

#your code
# Вертикальтно
pd.concat([s1, s2])
s1.append(s2)
# Горизонтально
pd.concat([s1, s2], axis=1)

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

**12\.** Как получить позиции строк из series A из другого series B? (★☆☆)

(можно с помощью numpy и с помощью pandas)

In [ ]:
s1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
s2 = pd.Series([1, 3, 10, 13])

#your code
s1[s1.isin(s2)].index

Int64Index([0, 4, 5, 8], dtype='int64')

**13\.** Как вычислить среднеквадратическую ошибку для истинных и предсказанных значений? (★★☆)

In [ ]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

#your code
MSE = np.square(np.subtract(truth, pred)).mean() 
MSE

0.33442822260238864

**14\.** Как конвертировать каждый первый элемент строке в series в верхний регистр? (★★☆)

In [ ]:
s = pd.Series(['how', 'to', 'kick', 'ass?'])

#your code
s.apply(lambda x: x.capitalize())

0     How
1      To
2    Kick
3    Ass?
dtype: object

**15\.** Как посчитать количество символов в каждой строке? (★★☆)

In [ ]:
s = pd.Series(['how', 'to', 'kick', 'ass?'])

#your code
s.apply(lambda x: len(x))

0    3
1    2
2    4
3    4
dtype: int64

**16\.** Как преобразовать даты в виде строк в timeseries?  (★☆☆)

(hint: pd.to_datetime)

In [ ]:
s = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

#your code
pd.to_datetime(s)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

**17\.** Как получить день месяца, номер недели, день года и день недели из даты в виде строки? (★★☆)

In [ ]:
s = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

#your code
dt_series = pd.to_datetime(s)

print("Date: \n", dt_series.apply(lambda x: x.date()), "\n")

print("Week number: \n", dt_series.apply(lambda x: x.week), "\n")

print("Day number of year: \n", dt_series.apply(lambda x: x.date()), "\n")

print("Day of week: \n", dt_series.apply(lambda x: x.dayofweek))

Date:
 0    2010-01-01
1    2011-02-02
2    2012-03-03
3    2013-04-04
4    2014-05-05
5    2015-06-06
dtype: object

Week number:
 0    53
1     5
2     9
3    14
4    19
5    23
dtype: int64

Day number of year:
 0    2010-01-01
1    2011-02-02
2    2012-03-03
3    2013-04-04
4    2014-05-05
5    2015-06-06
dtype: object

Day of week:
 0    4
1    2
2    5
3    3
4    0
5    5
dtype: int64

**18\.** Как конвертировать дату из формата месяц-год в формат год-месяц-первое число? (★★☆)

(hint: .strftime('%Y-%m-%d'))

In [ ]:
s = pd.Series(['Jan 2017', 'Feb 2019', 'Mar 2012'])

#your code
dt_series = pd.to_datetime(s)
dt_series.apply(lambda x: x.strftime('%Y-%m-%d'))

0    2017-01-01
1    2019-02-01
2    2012-03-01
dtype: object

**19\.** Как отфильтровать слова, содержащие не менее 2 гласных? (★★☆)

In [ ]:
s = pd.Series(['Kitty', 'Cat', 'Plan', 'Python', 'Money'])

#your code
# Википедиа говорит:
# "Буква «Y» может обозначать как согласный, так и гласный звуки"
# Так что возможно два варианта
print(s[s.str.count('(?i)[aeiou]') >=2], "\n")
# или с «Y»
s[s.str.count('(?i)[aeiouy]') >=2]

4    Money
dtype: object

0     Kitty
3    Python
4     Money
dtype: object

**20\.** Заполните все пропущенные даты от минимальной до максимальной, значения при этом дожны быть равны предыдущей не пропущеной дате (★★★)

In [ ]:
s = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

#your code
# Найдем сначала max и min даты
dt_series = pd.to_datetime(s.index)
min_date = dt_series.min()
max_date = dt_series.max()
# Сформируем диапазон от min_date to max_date
new_index = pd.date_range(min_date, max_date)
# Выполним переиндексирование объекта s, c использованием интерполяции
s.reindex(new_index, method='ffill')

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

**21\.** Считайте файл из CSV-файла по строчно и добавьте считанные строки в датафрейм (файл data/BostonHousing.csv)?  (★★☆)

(hint: csv reader)

In [ ]:
import csv
df_read = pd.Series()
    
with open('BostonHousing.csv', 'r') as csv_file:
  reader = csv.reader(csv_file)
  for row in reader:
    df_read = pd.concat([df_read, pd.Series(row)], axis=1)
    # print(pd.Series(row))
    # df_read.append(pd.DataFrame(pd.Series(row)))

df_read = df_read.T
df_read = df_read.rename(columns=df_read.iloc[1, :])
df_read = df_read.iloc[2:, :]
df_read.head()
# ну, а по простому df_read = pd.read_csv("BostonHousing.csv")

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

FileNotFoundError: ignored

**22\.** Как изменить значения столбца при импорте csv в фрейм данных?
Импортируйте датасет с помощью pd.read_csv, но колонку 'medv' (median house value) измените так, что если value < 25 = ‘Low’ и если > 25 = ‘High’.  (★★☆)

(hint: pd.read_csv(....., converts={}))

In [ ]:
dir_file = 'https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv'
df_read = pd.read_csv(dir_file, converters={'medv': lambda x: 'Low' if float(x) < 25 else 'High'})
df_read.head()

**23\.** Как импортировать только указанные столбцы('crim' и 'medv') и только n строк из CSV-файла?  (★☆☆)

In [ ]:
# nrows - кол-во строк для считывания
df_read = pd.read_csv(dir_file, nrows=5, usecols=['crim', 'medv'])
df_read

**24\.** Как получить кол-во строк, кол-во столбцов, тип столбцов, кол-во столбцов с таким типом данных, итоговую статистику каждого столбца датафрейма?  (★☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#  number of rows and columns
print("Кол-во строк:", len(df))
print("Кол-во столбцов:", len(df.columns))
print("Кол-во строк и столбцов:", df.shape)
# datatypes

# how many columns under each dtype

# summary statistics
df.info()

**25\.** Как извлечь номер строки и столбца конкретной ячейки с заданным критерием? (★☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

# Get Manufacturer with highest price
print(df.loc[df['Max.Price'].idxmax(), 'Manufacturer'])
# Get Row and Column number
print(df.loc[df['Max.Price'].idxmax()].name)
# Get the value
print(df.loc[df['Max.Price'].idxmax()]['Max.Price'])

**26\.** Переименнуйте колонку Type в CarType, в столбцах с '.' в названии замените её на '_'. Как добавить ко всем названиям колонок суффиксы?  (★☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
df = df.rename(columns={"Type": "CarType"})
df.columns = df.columns.str.replace(r".", "_")
df.head()

**27\.** Проверьте есть ли в датафрейме пропуски? Если да, посчитайте кол-во nan\none в каждом столбце датафрейма  (★★☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
if(df.isnull().values.any()):
  print(df.isna().sum())

**28\.** Как заменить отсутствующие значения нескольких числовых столбцов средним?  (★★☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
df = df.fillna(df.mean())
df.head()

**29\.** Как выбрать конкретный столбец из датафрейма в качестве датафрейма, а не series?  (★☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
# df.iloc[:, 0]
# df.loc[:, 'Model']
df[['Model']]

**30\.** Как изменить порядок столбцов данных? (☆☆☆)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
df = df.reindex(columns=sorted(df.columns))
df.head()

**31\.** Как установить количество строк и столбцов, отображаемых в выводе? (☆☆☆)

(hint: pd.set_option)

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code
pd.set_option('display.max_rows', 5)
pd.set_option('display.max_columns', 3)
df.head()

**32\.** Как получить номер строки, в которой содержится максимальное значение в столбце? (★★☆)

In [ ]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))

#your code
df['b'].idxmax()

**33\.** Как получить последние n строк датафрейма с суммой строк 100?  (★★★)

In [ ]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
# получить все строки сумма значений которых равна 100
df = df.loc[df.sum(axis=1) == 100]
# получить последние n строк датафрейма
n = 3
df.iloc[-n:]

### Выбросы (оutliers)

* 5 Ways to Detect Outliers/Anomalies That Every Data Scientist Should Know (Python Code)

https://towardsdatascience.com/5-ways-to-detect-outliers-that-every-data-scientist-should-know-python-code-70a54335a623

**34\.** Как найти и заменить выбросы из столбца Series или датафрейма? (★★★)

Замените все значения из столбца ниже 5того и больше 95го персентиля, на пограничные значения.

(hint: .quantile())

In [ ]:
s = pd.Series(np.logspace(-2, 2, 30))

#your code
boundary_val_bottom = s.quantile(0.05)
boundary_val_top = s.quantile(0.95)

s = s.mask(s < boundary_val_bottom, boundary_val_bottom)
s = s.mask(s > boundary_val_top, boundary_val_top)
s.head()

**35\.** Попробуйте реализовать метод Interquartile Range (IQR) (★★★)

Почитать про него можно по ссылке выше.

In [ ]:
s = pd.Series(np.logspace(-2, 2, 30))

#your code
def interquartile_range(df):
    Q1 = df.quantile(0.25)
    Q3 = df.quantile(0.75)
    IQR = Q3 - Q1
    lower_whisker = Q1 - 1.5*IQR
    upper_whisker = Q3 + 1.5*IQR
    return df.loc[((df >= lower_whisker) & (df <= upper_whisker))]

interquartile_range(s)

**36\.** Как поменять местами две строки данных? (★★★)

In [ ]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

#your code
def swap_rows(df, row_a, row_b):
    a, b = df.iloc[row_a, :].copy(), df.iloc[row_b, :].copy()
    df.iloc[row_a, :], df.iloc[row_b, :] = b, a
    return df

print(df.head()) # before
print(swap_rows(df, 0, 1).head()) # after

### one-hot-encoding

**37\.** Как создать однозначные кодировки категориальной переменной? (★★★)

Сделайте one-hot кодировку столбца 'a'.

In [38]:
df = pd.DataFrame([['aa', 'kek'], ['ba', 'lol'], ['ab', 'kek'], ['aa', 'lol'], ['cc', 'kek']], columns=['a', 'b'])

#your code
pd.get_dummies(df['a'])

   aa  ab  ba  cc
0   1   0   0   0
1   0   0   1   0
2   0   1   0   0
3   1   0   0   0
4   0   0   0   1

**38\.** Нормализуйте все столбцы в датафрейме. (★★★)

a) Нормализовать все столбцы df путем вычитания среднего значения столбца и деления на стандартное отклонение. 

b) Трансформируйте все столбцы df так, чтобы минимальное значение в каждом столбце было 0, а max = 1.

In [45]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

#your code
df_norm_a = (df-df.mean()) / df.std()
df_norm_b = (df - df.mean()) / (df.max() - df.min())

**39\.** Как получить конкретную группу из датафрейма сгруппированного по ключу? (★★★)

Сгруппируйте по 'name', и выведите данные по группе 'orange'.

(hint: groupby(), get_group())

In [47]:
df = pd.DataFrame({'name': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

#your code
df.groupby(['name']).get_group('orange')

     name     taste  price
2  orange  0.333957     14
5  orange  0.890841      8
8  orange  0.048351     14

**40\.** Как вычислить среднее значение по столбцу 'price' по каждому фрукту в датафрейме и сохранить сгруппированный столбец как другой столбец (не индекс)? (★★★)

In [63]:
df = pd.DataFrame({'name': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

#your code
df_mean = df.groupby(['name']).mean()
df_mean

           taste     price
name
apple   0.293510  5.333333
banana  0.648408  4.000000
orange  0.375286  6.000000

**41\.** Как объединить два датафрейма по двум столбцам, чтобы в них остались только общие строки?  (★★★)

Сделать merge двух датафреймов по колонкам ['fruit', 'weight'] и ['pazham', 'kilo'].

(hint: pd.merge https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html#merge )

In [49]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

#your code
df1.merge(df2, how = 'inner', left_on=['fruit', 'weight'], right_on=['pazham', 'kilo'])

    fruit weight  price_x  pazham  kilo  price_y
0   apple   high       12   apple  high       14
1   apple   high        6   apple  high       14
2   apple   high        4   apple  high       14
3  orange    low        0  orange   low       13
4  orange    low        9  orange   low       13
5  orange    low        8  orange   low       13

**42\.** Как удалить строки из датафрейма А, которые присутствуют в датафрейме B? (★★★)

In [75]:
df1 = pd.DataFrame({'fruit': ['apple', 'orange', 'banana'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.arange(9)})

df2 = pd.DataFrame({'fruit': ['apple', 'orange', 'pine'] * 2,
                    'weight': ['high', 'medium'] * 3,
                    'price': np.arange(6)})

#your code
df = pd.merge(df1, df2, how="outer", indicator=True).query('_merge=="left_only"')
df.reset_index(drop=True).drop('_merge', 1)

    fruit  weight  price
0  banana     low      2
1   apple    high      3
2  orange  medium      4
3  banana     low      5
4   apple    high      6
5  orange  medium      7
6  banana     low      8

**43\.** Как получить номера строк, в которых совпадают значения двух столбцов? (★★★)

(hint: np.where)

In [86]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})


#your code
df_out = df.loc[df['fruit1'] == df['fruit2']]
list(df_out.index)

[0, 2, 3, 7, 9]

**44\.** Создайте столбец a_shift со сдвигом на одну строку назад. (★★★)

(hint: .shift())

In [91]:
df = pd.DataFrame(np.random.randint(1, 100, 20).reshape(-1, 4), columns = list('abcd'))

#your code
df['a_shift'] = df['a'].shift(-1, axis = 0) 
df

    a   b   c   d  a_shift
0  40  88  92  84     26.0
1  26   2  63  44     98.0
2  98  95  58  24     34.0
3  34  22  45   5     87.0
4  87  76  68  78      NaN

**45\.** Как разбить текстовый столбец на три отдельных столбца? (★★★)

Разбить на три столбцы STD, City, State

In [ ]:
df = pd.DataFrame(["STD, City    State",
"33, Kolkata    West Bengal",
"44, Chennai    Tamil Nadu",
"40, Hyderabad    Telengana",
"80, Bangalore    Karnataka"], columns=['row'])

#your code

### **46\.** Ну а теперь все вместе.  (★★★★★★★★★★)

* Заменяем все точки в названии на '_'
* Выделить категориальные признаки
* Посчитать кол-во уникальных значений во всех текстовых\категориальных столбцах. 
* Колонки с только уникальными значениями удаляем (например Model и Make)
* Для столбцов у которых значений более 10, оставляем топ 10 значений, остальные заменяем на 'other'
* Числовые столбцы проверяем на пропуски. Подсчитываем кол-во nan\none и делим на размер датафрейма -сохраняем в отдельный датафрейм, это доля пропусков в каждом столбце
* Чистим выбросы. Во всех числовых столбцах заменяем все значения столбца меньше 5го персентиля и больше 95ого персентиля на эти пограничные значения.
* Заполняем пропуски в числовых столбцах на среднее по столбцу, в текстовых столбцах на 'other'
* Все категориальные признаки превращаем в one-hot-encoding
* Создать новый столбец Length_Width = Length * Width
* Столбцы MPG_cityми MPG_highway из MPG перевести в единицы LPG (литры \100 км) = (100 * 3,785)  / (MPG * 1,609)
* Посчитать среднюю цену по каждому типу машины у каждого производителя
* Посчитать максимальные Length и Width по Type
* Посчитать кол-во моделей машин по типу машины и наличию подушки безопасности (агрегирование по столбцам Type и AirBags)
* Посчитать кол-во машин по каждому типу машины у каждого производителя(агрегирование по столбцам Type и Manufacturer)
* Посчитать кол-во машин по Manufacturer-Man_trans_avail
* Вывести у какой модели, какого изготовителя максимальная вместимость по пассажирам

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

#your code

In [ ]:
df

**47\.** Перевести индексы первого и третьего уровня в колонки

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})
df1 = df.set_index(['t_id', 'school_code', 'class'])
df1

**48\.** Вывести строку из Series и DataFrame по заданному индексу

In [ ]:
ds = pd.Series([1,3,5,7,9,11,13,15], index=[0,1,2,3,4,5,7,8])
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32]})

indx = 4

**49\.** Найти индексы строк с пропущенными данными

In [ ]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
df

**50\.** Сделать left join датафреймов

In [ ]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']}) 
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})

**51\.** Соединить два датафрейма

In [ ]:
data1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

data2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])

**52\.** Сгруппировать датафрейм по полям 'customer_id' и 'salesman_id' и отсортировать по sum of purch_amt внутри каждой группы

In [ ]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

**53\.** Сгруппировать датафрейм по месяцу и году из даты ord_date и найти общее количество заказов по годам и по месяцам

In [ ]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['05-10-2012','09-10-2012','05-10-2013','08-17-2013','10-09-2013','07-27-2014','10-09-2012','10-10-2012','10-10-2012','06-17-2014','07-08-2012','04-25-2012'],
'customer_id':[3001,3001,3005,3001,3005,3001,3005,3001,3005,3001,3005,3005],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

# Regular expressions with Pandas

**1\.** Выделить в отдельную колонку event_id первую цифру в кавычках, во вторую колонку event_probability вероятность (★☆☆)

In [ ]:
df=pd.DataFrame({'col1':["{'34': 0.9839372122311848}",
                         "{'77': 0.6724645988404411}",
                         "{'77': 0.6491011266207006}",
                         "{'77': 0.6123085784265466}",
                         "{'34': 0.87}",
                         "{'77': 0.6225699652019304}",
                         "{'3': 0.5470808226524633}",
                         "{'77': 0.6233849004135044}",
                         "{'77': 0.7050888998743866}",
                         "{'52': 0.8945052223205372}"]})

#your code
df['event_probability'] = df['col1'].str.extract(r'(\d+.\d+)')
df['col1'] = df['col1'].str.extract(r'(\d+)')
df = df.rename(columns={'col1': 'event_id'})
df

  event_id   event_probability
0       34  0.9839372122311848
1       77  0.6724645988404411
2       77  0.6491011266207006
3       77  0.6123085784265466
4       34                0.87
5       77  0.6225699652019304
6        3  0.5470808226524633
7       77  0.6233849004135044
8       77  0.7050888998743866
9       52  0.8945052223205372

**2\.** Удалите все тэги, переносы строк из текстов новостей (★★★)

(hint: df.column.str())

In [ ]:
df = pd.read_excel('news.xlsx')

#your code
# удаляем html tags
df.replace(r'(<[^>]*>)','',regex=True, inplace = True)
# удаляем пробелы в начале и конце строки и символы переноса строки.
df.replace(r'(^\s+|\n|\r|\s+$)','',regex=True, inplace = True)
df.head()

                                                text
0  Сообщение о существенном факте         о выпла...
1  НИЖНИЙ      НОВГОРОД, 3 декабря 2019, 22:41 - ...
2  УЛЬЯНОВСК, 3 декабря 2019, 11:38 - REGNUM В   ...
3  Самарская область признана одним из лидеров ре...
4  Окружная администрация Якутска подписала согла...

**3\.** Проставьте флаг в колонку source_ria если текст новости содержит: риа новости, тасс, коммерсант. Перед поиском переведите тексты в lower и удалите все кроме букв. Данные после чистки из предыдушего задания (★★★)

(hint: df.column.str())

In [ ]:
# переведите тексты в lower
df["text"] = df["text"].str.lower()
# удалите все кроме букв, пробелы оставил) 
df.replace(r'([^ a-zа-яё])',' ',regex=True, inplace = True)
# там ещё есть лишние пробелы. Давайте их тоже уберем 
df.replace(r'\s+',' ', regex=True, inplace = True)
df['source_ria'] = df['text'].str.match(r'.*(риа новости|тасс|коммерсант).*')
# df.head()
df

                                                 text  source_ria
0   сообщение о существенном факте о выплаченных д...       False
1   нижний новгород декабря regnum бывший глава му...       False
2   ульяновск декабря regnum в ульяновском индустр...       False
3   самарская область признана одним из лидеров ре...       False
4   окружная администрация якутска подписала согла...       False
5   во время рабочей поездки по смоленску и смолен...       False
6   сегодня ввп россии на процентов наполняется за...       False
7   уфа декабря regnum более млрд рублей инвестиру...       False
8   минеральные воды ставропольский край декабря т...        True
9    декабря в большом зале администрации сузунско...       False
10  конкурс на реконструкцию впп в новосибирском а...        True
11  название компании непубличное акционерное обще...       False
12  москва дек риа новости прайм российский произв...        True
13  москва декабря тасс топливная компания росатом...        True
14  в этом году в калтасинском районе агрохолдинг ...       False
15  софия декабря regnum правительство болгарии од...       False
16  дата on источник управление по связям с общест...       False
17  нур султан казинформ депутаты сената парламент...       False
18  samsung heavy industries поставит верфи звезда...        True
19  в администрации краснодарского края подвели пр...       False

**4\.** Отфильтруйте строки с валидными емейлами (★★★)

In [ ]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com', 'kek lol@mail.ru'])

#your code
emails.str.extract(r'(^[a-zA-Z0-9_.+-]+@[a-zA-Z0-9-]+\.[a-zA-Z0-9-.]+$)').dropna()

**5\.** Напишите паттерн для поиска строки содержащей только буквы в верхнем и нижнем регистре, цифры и подчеркивание

In [ ]:
import re
str_demo = "ABC rameses@egypt.com word mdfe 55555 narendra ewfwv llol lll 103058jf sdfsfsfsd fg"
re.findall(r'(\b\w+|\d+|[_]+\b)', str_demo)

['ABC',
 'rameses',
 'egypt',
 'com',
 'word',
 'mdfe',
 '55555',
 'narendra',
 'ewfwv',
 'llol',
 'lll',
 '103058jf',
 'sdfsfsfsd',
 'fg']

**6\.** Замените пробелы на подчеркивание и наоборот

In [ ]:
df_new = df.copy()
df_new.replace(r'\s','_',regex=True, inplace = True)
df_new.replace(r'_', ' ',regex=True, inplace = True)

NameError: ignored

**7\.** Найдите слова длиной 3,4,5

In [ ]:
str_demo = "ABC rameses@egypt.com word mdfe 55555 narendra ewfwv llol lll 103058jf sdfsfsfsd fg"
re.findall(r'(\b[\wа-яёА-ЯЁ]{3,5}\b)', str_demo)

['ABC', 'egypt', 'com', 'word', 'mdfe', '55555', 'ewfwv', 'llol', 'lll']

**8\.** Сделайте регистронезависимую замену(replace) во входной строке